#include "initKey.cuh"
//sine混沌映射初始值和参数值
double std_a=3.764864654565236;//0-2*pi
double std_b=1.598741258692525;//0-2*pi
double std_k=17.589465464565456;//>0

//三维猫映射初始值和参数值
double cat3D_x = 0.192417345678913;//0-1
double cat3D_y = 0.556712345678916;//0-1
double cat3D_z = 0.932112345678123;//0-1
//洛伦兹混沌映射初始值和参数值
double lorenz_y = 0.786545641346986;//0-1
double lorenz_z = 0.253456749812345;//0-1
double lorenz_q = 0.598745498583658;//0-1
 __device__ int dev_lorenz_f = 10;
 __device__ int dev_lorenz_r = 28;
 __device__ double dev_lorenz_g = 8 / 3.0;

//sine2D混沌映射初始值和参数值
 double sine2D_a= 37.857334516296548;//范围--负无穷到正无穷
 double sine2D_b= 17.346265259595841;//范围--负无穷到正无穷

 double sine2D_x= 0.265916526436985;//0-1
 double sine2D_y= 0.695234546969854;//0-1

//logistic混沌映射初始值和参数值
 double logistic_u = 4.0;
 double logistic_x = 0.387368565654668;//0-1

/*
一共14个需要更新的值，前十二个利用前24组哈希值
剩下两个利用剩下的八个哈希值
*/

__device__ double dev_std_a;//0-1
__device__ double dev_std_b;//0.87-1
__device__ double dev_std_k;//0.87-1
//三维猫映射初始值和参数值
 __device__ double dev_cat3D_x;//0-1
 __device__ double dev_cat3D_y;//0-1
 __device__ double dev_cat3D_z;//0-1
//洛伦兹混沌映射初始值和参数值
 __device__ double dev_lorenz_y;//0-1
 __device__ double dev_lorenz_z ;//0-1
 __device__ double dev_lorenz_q ;//0-1

 __device__ double dev_pi = 3.14159265358979323846;//0-1
 double pi = 3.14159265358979323846;//

__device__ char dna_sbox[1024] = { 'T','G','C','A','T','C','A','C','A','G','T','T','G','T','G','A','A','T','G','G','C','G','T','A','C','C','G','C','A','A','C','T',
                                   'A','A','T','T','C','T','C','A','T','G','A','G','T','C','A','C','G','G','C','G','T','A','G','T','G','C','C','C','A','T','G','A',
                                   'C','A','A','C','T','G','G','A','T','C','C','G','A','G','G','T','T','T','T','A','G','C','C','T','A','T','G','G','C','C','A','A',
                                   'T','T','T','A','G','A','A','G','C','A','G','C','A','C','C','T','C','C','G','T','A','T','T','G','G','G','A','A','C','G','T','C',


                                   'T','T','A','G','C','A','T','C','G','C','C','T','A','T','G','A','C','G','G','T','A','C','T','G','T','A','A','A','G','G','C','C',
                                   'A','T','T','G','G','A','G','T','T','T','A','C','C','A','T','C','T','A','A','A','A','G','C','C','G','C','C','G','C','T','G','G',
                                   'A','A','T','C','G','T','C','T','C','C','G','A','T','G','A','G','G','G','C','A','T','A','G','C','C','G','A','T','A','C','T','T',
                                   'T','G','C','A','C','C','A','G','A','T','T','T','G','A','A','C','C','T','G','C','G','T','T','A','A','A','G','G','T','C','C','G',


                                   'T','T','C','C','T','A','G','T','A','T','C','G','G','G','A','A','C','A','G','A','G','C','A','G','T','G','A','C','C','T','T','C',
                                   'G','A','A','G','C','C','T','A','C','G','A','C','A','T','T','T','C','T','T','C','A','A','G','T','G','C','T','G','G','G','C','A',
                                   'G','A','A','T','A','C','T','A','T','C','G','G','C','G','C','C','T','G','C','A','C','T','G','C','A','A','T','T','G','T','A','G',
                                   'C','A','T','T','G','A','C','C','A','T','T','A','T','C','A','G','A','C','G','G','G','T','C','G','T','G','A','A','C','T','G','C',


                                   'A','C','C','A','C','T','G','C','G','G','A','T','T','A','T','T','G','A','G','T','T','G','A','A','T','C','C','G','A','G','C','C',
                                   'C','A','T','G','T','C','A','A','A','T','C','C','G','G','G','C','A','G','A','C','G','T','C','G','G','A','T','T','C','T','T','A',
                                   'T','T','A','T','T','A','G','G','C','G','T','C','A','C','C','A','C','C','G','A','G','C','C','T','A','A','G','T','T','G','A','G',
                                   'G','C','C','C','G','G','A','T','T','T','G','A','C','A','T','G','T','A','A','G','A','A','T','C','C','G','A','C','G','T','C','T',


                                   'C','A','G','C','T','C','C','T','T','G','A','A','A','G','T','A','A','C','T','T','C','G','G','G','G','T','C','C','G','A','A','T',
                                   'G','A','A','G','C','A','G','C','T','C','T','G','G','T','C','T','T','T','C','C','G','G','A','A','C','G','A','T','A','C','T','A',
                                   'T','C','C','A','C','T','A','G','A','A','G','T','T','G','A','C','G','G','A','T','G','C','T','T','T','A','C','G','C','C','G','A',
                                   'A','G','A','C','G','C','T','G','C','T','G','A','C','A','G','T','T','A','G','G','C','C','A','T','A','A','T','C','T','T','C','G',


                                   'C','G','G','T','A','A','C','C','A','T','G','A','T','A','A','G','G','G','C','T','G','C','T','G','C','A','T','C','T','T','A','C',
                                   'A','A','C','C','T','G','G','A','T','C','C','G','A','T','T','T','T','A','G','T','C','T','C','A','G','G','A','C','G','C','A','G',
                                   'A','T','C','A','C','C','T','T','G','A','A','G','C','G','G','C','T','C','G','G','T','G','A','A','G','T','C','T','A','C','T','A',
                                   'T','G','G','C','G','A','C','G','A','T','T','T','C','C','A','A','A','C','C','A','G','T','T','C','T','A','G','G','A','G','C','T',


                                   'C','T','G','A','T','G','A','G','A','A','T','T','G','T','A','C','T','A','A','T','G','C','C','A','C','C','G','G','C','G','T','C',
                                   'A','C','T','T','G','A','C','A','C','T','G','C','T','C','G','G','A','G','T','A','C','C','A','T','T','G','A','A','G','T','C','G',
                                   'T','C','C','T','G','A','A','C','A','T','T','A','C','A','A','G','G','G','A','A','C','G','G','T','T','T','C','C','G','C','T','G',
                                   'C','G','G','A','A','C','G','T','T','C','C','T','G','G','C','A','G','C','C','C','T','T','A','A','A','G','T','G','T','A','A','T',


                                   'A','G','T','C','C','T','G','T','G','C','A','A','C','A','T','G','C','C','C','G','T','A','A','C','G','G','T','T','A','T','G','A',
                                   'T','G','A','A','A','G','C','T','C','C','T','A','G','A','G','T','A','T','G','G','G','C','C','A','T','T','A','C','C','G','T','C',
                                   'G','A','C','A','G','T','T','G','C','G','A','T','A','C','T','C','T','T','G','C','C','C','A','G','A','A','T','A','G','G','C','T',
                                   'T','C','T','G','A','C','G','A','G','T','C','C','C','T','A','G','A','A','A','T','C','G','T','T','T','A','G','G','G','C','C','A'
};